Repository: ryzom/ryzomcore
Catalog: ryzom/tools/client/client_install/gui/*.resx
Languages: de, fr

# uiAllocating
source: Allocating
fr: Allocation

# uiAskForInstall
source: Download successful - Begin installation
de: Download abgeschlossen - Beginne Installation
fr: Fin du téléchargement des données - Procéder à l'installation.

# uiCancel
source: Cancel
de: Abbrechen
fr: Annuler

# uiCanNotDownload
source: There has been an error downloading one of the Ryzom installation files.\nPlease make sure that you have sufficient disk space and that your internet connection is operating correctly.
de: Fehler beim Laden einer Ryzom Installationsdatei.\nBitte prüfe Deinen verfügbaren Speicherplatz und Deine Internetverbindung.
fr: Il y a eu un problème pendant le téléchargement des fichiers d'installation de Ryzom.\nMerci de vous assurer que vous avez suffisamment d'espace disque et que votre connexion internet est fonctionnelle.

# uiCanNotInstall
source: There has been an error installing one of the Ryzom installation files.\nPlease make sure that you have sufficient disk space for the installation.
de: Fehler beim Installieren einer Ryzom Installationsdatei.\nBitte prüfe Deinen verfügbaren Speicherplatz.
fr: Il y a eu un problème pendant l'installation d'un fichiers d'installation de Ryzom.\nMerci de vous assurer que vous avez suffisamment d'espace disque pour procéder à l'installation.

# uiCategoryDownload
source: Downloading (1/2)
de: Download (1/2)
fr: Téléchargement (1 / 2)

# uiCategoryInstall
source: Installing (2/2)
de: Installiere (2/2)
fr: Installation (2 / 2)

# uiCheckBoxUseTorrentLabel
source: Turbo Mode
fr: Mode turbo

# uiCheckData
source: Check data
de: Überprüfe Daten
fr: Vérification des données

# uiChecking
source: Checking
de: Prüfe
fr: Vérification

# uiConnecting
source: Connecting
de: Verbinde
fr: Connexion

# uiContentInstallSuccess
source: Ryzom has been installed successfully
de: Ryzom wurde erfolgreich installiert.
fr: Ryzom à été installé avec succès.

# uiContentStartProcessFullVersion
source: You have opted to only install the minimum files required to start playing. The remaining files will be downloaded and installed while you play.
fr: Vous avez choisi d'installer la version minimale nécessaire pour jouer. Le reste des fichiers sera téléchargé pendant que vous jouerez.

# uiContentStartProcessInstall
source: You are about to download and install the latest version of Ryzom.\nThe complete version of Ryzom requires {0} of disk space.
de: Du stehst kurz davor, Ryzom herunterzuladen.\nDie Vollinstallation von Ryzom benötigt: {0} Festplattenspeicher.
fr: Vous êtes sur le point de télécharger et d'installer la dernière version de Ryzom.\n\nLa version complète de Ryzom nécessite {0} d'espace disque.

# uiContentStartProcessRepair
source: You are about to update your installation of Ryzom to the latest version.\nThis operation will repair any files that are damaged or missing.\nAt the end of the update the game configuration options will be reset to the default values.
de: Du stehst kurz davor, Ryzom zu updaten.\n Dieser Vorgang wird ebenfalls fehlende oder beschädigte Dateien ersetzen.\nNach dem Update werden alle Konfigurationseinstellungen auf die Standardwerte zurückgesetzt..
fr: Vous êtes sur le point de mettre à jours votre installation de Ryzom à la dernière version.\n\nCette opération va réparer les fichiers qui sont manquants ou endommagés.\n\nA la fin de la mise à jours les fichiers de configurations du jeu seront remis à zero.

# uiContentStartProcessTorrent
source: 'Turbo Download' uses BitTorent technology to download from several servers at a time. Disabling 'Turbo Download' can fix some types of download problem.
de: 'Turbo Download' verwendet das BitTorent Protokoll, um Dateien gleichzeitig von mehreren Server zu laden. Solltest Du Probleme beim Download haben, deaktiviere diese Funktion.
fr: Le 'Mode Turbo' utilise la technolgie peer-to-peer pour accélérer le téléchargement. Désactiver cette option peut résoudre certains problèmes.

# uiContinue
source: Continue
de: Weiter
fr: Continuer

# uiDownloadingMetadata
source: Downloading meta data
de: Metadaten herunterladen
fr: Téléchargement des métadata

# uiDownloadListUpdated
source: The download list has been updated.
de: Die Downloadliste wurde aktualisiert.
fr: La liste des fichiers à télécharger à été mise à jours

# uiDownloadOnly
source: Downloading without installing
fr: Télécharger sans installer

# uiErrorSupportFormat
source: Tips on solving common problems on the www.ryzom.com/support
de: FAQ für bekannte Probleme bei der Ryzom Installation: www.ryzom.com/support
fr: Des solutions pour les problèmes le plus commun peuvent se trouver sur {0}.

# uiErrorSupportUrl
source: http://forums.ryzom.com/forum/showthread.php?t=29129
de: http://forums.ryzom.com/forum/showthread.php?t=29131
fr: http://forums.ryzom.com/forum/showthread.php?t=29130

# uiFinished
source: Finishing
de: Abschliessen
fr: Finition

# uiFullVersion
source: Full Version
de: Vollversion
fr: Version complète

# uiHour
source: {0} hour
fr: {0} heure

# uiHours
source: {0} hours
fr: {0} heures

# uiInstall
source: Install >
de: Installation >
fr: Installer >

# uiInstallFinished
source: Installation finished.\n\nYou can now play to Ryzom.
de: Installation abgeschlossen.\n\nDu kannst nun Ryzom spielen.
fr: Fin de l'installation.\n\nVous pouvez maintenant jouer à Ryzom.

# uiInstallFormat
source: Install {0} ( {1} of {2})
de: Installieren {0} ( {1} von {2})
fr: Installation de {0} ( {1} sur {2})

# uiLaunchAtEnd
source: Launch Ryzom at end of installation
de: Starte Ryzom nach abgeschlossener Installation
fr: Lancement de Ryzom à la fin de l'installation

# uiLoadDownloadList
source: Updating download list
de: Aktualisiere Download Liste
fr: Mise à jour de la liste des fichiers à télécharger

# uiLoadPackageList
source: Loading available package list
de: Lade die Liste d verfügbaren Pakete
fr: Chargement de la liste des packages disponible

# uiLoadTorrent
source: Downloading hash infos
de: Laden Hash Informationen
fr: Téléchargement du fichiers de signature

# uiLoadVersionError
source: Error impossible to load version infos. Please make sure your internet connection is operating correctly.
de: Fehler beim Laden der Versionsinformationen. Bitte prüfe Deine Internetverbindung.
fr: Impossible de charger les informations de version.

# uiLoadVersionInfo
source: Loading Version Infos
de: Lade Version Infos
fr: Chargement des informations de version

# uiNoUpdateNeeded
source: No update needed
de: Kein Update erforderlich
fr: Pas de mise à jour nécessaire

# uiPatch
source: Downloading
fr: Téléchargement

# uiQueued
source: Queued
fr: Mise en file d'attente

# uiQuitInstallContent
source: Do your realy want to quit the installation program.
de: Willst Du das Installationsprogramm wirklich abbrechen?
fr: Etes-vous sûre de vouloir quitter l'application?

# uiQuitInstallRestart
source: You will be able to to continue the install process where you have left it by clicking on the Ryzom icon on your desktop.
de: Um das Installieren fortzusetzen, klicke das Ryzom Icon auf Deinem Desktop.
fr: Vous pourrez continuer le processus d'installation à l'endroit où vous l'avez quitté en cliquant sur l'icône Ryzom présent sur votre bureau.

# uiQuitInstallTitle
source: Quit?
fr: Quitter?

# uiRateFormat
source: at {0}/s
fr: à {0}/s

# uiRepair
source: repair
de: reparieren
fr: réparer

# uiRequiredSize
source: Size needed: {0}
de: Notwendige Grösse: {0}
fr: Taille requise: {0}

# uiRestarting
source: The program will be relaunched
de: Das Programm wird neu gestarted
fr: L'installeur va être relancé

# uiRyzomInstall
source: Ryzom Install
fr: Installation de Ryzom

# uiRyzomUpdateRepair
source: Ryzom Install and Repair
de: Ryzom installieren oder reparieren
fr: Réparation et mise à jour et de de Ryzom.

# uiScanData
source: Checking integrity
de: Überprüfe die Integrität
fr: Vérification approfondie

# uiSeeding
source: Seeding
fr: Partage

# uiSelectPackage
source: Package selection
de: Packet Auswahl
fr: Sélection de la version à télécharger

# uiTimeLeft
source: ({0} left)
de: ({0} verbleibend)
fr: ({0} restante(s))

# uiTitleInstallSuccess
source: Congratulations
de: Glückwunsch!
fr: Felicitation

# uiTitleStartProcessInstall
source: Welcome to the Ryzom Installer
de: Willkommen beim Ryzom Installationsprogram
fr: Ryzom\nInstallation

# uiTitleStartProcessRepair
source: Ryzom Update / Repair
de: Ryzom installieren oder reparieren
fr: Ryzom\nRéparation et mise à jour.

# uiUpdateFormat
source: {2} ({0} of {1})
de: {2} ({0} von {1})
fr: {2} ({0} sur {1})

# uiUpdateLauncher
source: Updating the install program
de: Aktualisiere das Installationsprogramm
fr: Mise à jour de l'installeur

# uiMinutes
source: {0} minutes
de: {0} Minuten

# uiSeconde
source: {0} seconde
de: {0} Sekunde

# uiSecondes
source: {0} secondes
de: {0} Sekunden
