// NeL - MMORPG Framework <http://dev.ryzom.com/projects/nel/>
// Copyright (C) 2010  Winch Gate Property Limited
//
// This program is free software: you can redistribute it and/or modify
// it under the terms of the GNU Affero General Public License as
// published by the Free Software Foundation, either version 3 of the
// License, or (at your option) any later version.
//
// This program is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU Affero General Public License for more details.
//
// You should have received a copy of the GNU Affero General Public License
// along with this program.  If not, see <http://www.gnu.org/licenses/>.

#include "std3d.h"


#include "nel/3d/vegetable_manager.h"
#include "nel/3d/driver.h"
#include "nel/3d/texture_file.h"
#include "nel/misc/fast_floor.h"
#include "nel/3d/vegetable_quadrant.h"
#include "nel/3d/dru.h"
#include "nel/3d/radix_sort.h"
#include "nel/3d/scene.h"
#include "nel/3d/vegetable_blend_layer_model.h"
#include "nel/3d/vegetable_light_ex.h"
#include "nel/misc/hierarchical_timer.h"

#include <algorithm>


using namespace std;
using namespace NLMISC;


namespace NL3D
{


#define	NL3D_VEGETABLE_CLIP_BLOCK_BLOCKSIZE			16
#define	NL3D_VEGETABLE_SORT_BLOCK_BLOCKSIZE			64
#define	NL3D_VEGETABLE_INSTANCE_GROUP_BLOCKSIZE		128



	# Do the rot 2 times for normal (works fine)										\n\
	DP3	R6.x, R7, R0;																	\n\
	DP3	R6.y, R8, R0;																	\n\
	DP3	R6.z, R9, R0;				# R6= bended normal.								\n\
																						\n\
	# Normalize normal, and dot product, into R0.x										\n\
	# w hasn't been written                                                             \n\
	DP3	R0.x, R6.xyzz, R6.xyzz;		# R0.x= R6.sqrnorm()								\n\
	RSQ R0.x, R0.x;					# R0.x= 1/norm()									\n\
	MUL	R6, R6.xyzz, R0.x;				# R6= R6.normed()								\n\
	DP3	R0.x, R6, c[9];																	\n\
																						\n\
	#FrontFacing																		\n\
	MAX	R0.y, -R0.x, c[8].x;		# R0.y= diffFactor= max(0, -R6*LightDir)			\n\
	MUL	R1.xyz, R0.y, v[3];			# R7= diffFactor*DiffuseColor						\n\
	ADD	o[COL0].xyz, R1, v[4];		# col0.RGB= AmbientColor + diffFactor*DiffuseColor	\n\
	MOV o[COL0].w, c[8].y;																\n\
";


// ***********************
/*
	Unlit start program:
		bend pos into R5, and copy color(s)
*/
// ***********************


// Unlit no alpha blend.
const char* NL3D_UnlitVegetableProgram=
"	MOV o[COL0].xyz, v[3];			# col.RGBA= vertex color							\n\
																						\n\
	MOV o[COL0].w, c[8].y;																\n\
";


// Unlit with AlphaBlend.
const char* NL3D_UnlitAlphaBlendVegetableProgram=
"	MOV o[COL0].xyz, v[3];			# col.RGBA= vertex color							\n\
																						\n\
	#Blend transition. NB: in R5, we already have the position relative to the camera	\n\
	DP3	R0.x, R5, R5;				# R0.x= sqr(dist to viewer).						\n\
	RSQ R0.y, R0.x;																		\n\
	MUL R0.x, R0.x, R0.y;			# R0.x= dist to viewer								\n\
	# setup alpha Blending. Distance of appartition is encoded in the vertex.			\n\
	MAD o[COL0].w, R0.x, c[11].x, v[9].w;												\n\
";



// ***********************
/*
	Common end of program: project, texture. Take pos from R5
*/
// ***********************
const char* NL3D_CommonEndVegetableProgram=
"	# compute in Projection space														\n\
	DP4 o[HPOS].x, c[0], R5;															\n\
	DP4 o[HPOS].y, c[1], R5;															\n\
	DP4 o[HPOS].z, c[2], R5;															\n\
	DP4 o[HPOS].w, c[3], R5;															\n\
	# copy Dynamic lightmap UV in stage0, from colors Alpha part.						\n\
	MAD o[TEX0].xzw, v[3].w, c[8].yxxx, c[8].xxxy;										\n\
	MOV o[TEX0].y, v[4].w;																\n\
	# copy diffuse texture uv to stage 1.												\n\
	MOV o[TEX1], v[8];																\n\
";

// fogged version
const char* NL3D_VegetableProgramFog =
"	DP4	o[FOGC].x, c[6], R5;															\n\
";


// ***********************
/*
	Speed test VP, No bend,no lighting.
*/
// ***********************
const char* NL3D_SimpleStartVegetableProgram=
"!!VP1.0																				\n\
	# compute in Projection space														\n\
	MAD	R5, v[0], c[8].yyyx, c[8].xxxy;													\n\
	ADD	R5.xyz, R5, v[10];																\n\
	# make local to camera pos															\n\
	ADD R5, R5, -c[10];																	\n\
	MOV o[COL0].xyz, v[3];			# col.RGBA= vertex color							\n\
";

class CVertexProgramVeget : public CVertexProgram
{
public:
	struct CIdx
	{
		// 0-3 modelViewProjection
		// 4
		// 5
		// 6 fog
		// 7
		uint ProgramConstants0; // 8
		uint DirectionalLight; // 9
		uint ViewCenter; // 10
		uint NegInvTransDist; // 11
		// 12
		// 13
		// 14
		// 15
		uint AngleAxis; // 16
		uint Wind; // 17
		uint CosCoeff0; // 18
		uint CosCoeff1; // 19
		uint CosCoeff2; // 20
		uint QuatConstants; // 21
		uint PiConstants; // 22
		uint LUTSize; // 23 (value = 64)
		uint LUT[NL3D_VEGETABLE_VP_LUT_SIZE]; // 32+
	};
	CVertexProgramVeget(uint vpType, bool fogEnabled)
	{
		// nelvp
		{
			CSource *source = new CSource();
			source->Profile = nelvp;
			source->DisplayName = "nelvp/Veget";
			
			// Init the Vertex Program.
			string	vpgram;
			// start always with Bend.
			if( vpType==NL3D_VEGETABLE_RDRPASS_LIGHTED || vpType==NL3D_VEGETABLE_RDRPASS_LIGHTED_2SIDED )
			{
				source->DisplayName += "/Bend";
				vpgram= NL3D_BendProgram;
			}
			else
			{
				source->DisplayName += "/FastBend";
				vpgram= NL3D_FastBendProgram;
			}

			// combine the VP according to Type
			switch(vpType)
			{
			case NL3D_VEGETABLE_RDRPASS_LIGHTED:
			case NL3D_VEGETABLE_RDRPASS_LIGHTED_2SIDED:
				source->DisplayName += "/Lighted";
				vpgram+= string(NL3D_LightedStartVegetableProgram);
				break;
			case NL3D_VEGETABLE_RDRPASS_UNLIT:
			case NL3D_VEGETABLE_RDRPASS_UNLIT_2SIDED:
